Grooming/src/Documents/УстановкаУчетнойПолитикиОрганизации/УстановкаУчетнойПолитикиОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаУчетнойПолитикиОрганизации</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>InformationRegister.УчетнаяПолитика</registerRecords>
  <attributes>
    <name>УчетнаяПолитика</name>
    <type>
      <types>EnumRef.ВидыУчетнойПолитики</types>
    </type>
  </attributes>
</mdclass:Document>

Grooming/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>EnumRef.ВидыУчетнойПолитики</types>
    </type>
  </resources>
</mdclass:InformationRegister>

Grooming/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Grooming/src/Enums/ВидыУчетнойПолитики/ВидыУчетнойПолитики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУчетнойПолитики</name>
  <enumValues>
    <name>FEFO</name>
  </enumValues>
  <enumValues>
    <name>ПоСредней</name>
  </enumValues>
</mdclass:Enum>

Grooming/src/Documents/УстановкаУчетнойПолитикиОрганизации/ObjectModule.bsl
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.УчетнаяПолитика = УчетнаяПолитика;

	ДействующаяУчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПустаяСсылка();
	РезультатДействующаяУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.СрезПоследних(Новый Граница(МоментВремени()));

	Если РезультатДействующаяУчетнаяПолитика.Количество() <> 0 Тогда
		ДействующаяУчетнаяПолитика = РезультатДействующаяУчетнаяПолитика.Получить(0).УчетнаяПолитика;
	Иначе
		ДвижениеПервое = Движения.УчетнаяПолитика.Добавить();
		ДвижениеПервое.Период = '00020101000000';
		ДвижениеПервое.УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.FEFO;

	КонецЕсли;

	Если УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.FEFO Тогда
		Константы.ИспользоватьСрокиГодности.Установить(Истина);
	КонецЕсли;

	Если УчетнаяПолитика = Перечисления.ВидыУчетнойПолитики.ПоСредней И ДействующаяУчетнаяПолитика
		<> Перечисления.ВидыУчетнойПолитики.ПоСредней Тогда

		Константы.ИспользоватьСрокиГодности.Установить(Ложь);
		Движения.ТоварыНаСкладах.Записывать = Истина;

		Блокировка = Новый БлокировкаДанных;
		Блокировка.Добавить("РегистрНакопления.ТоварыНаСкладах");
		Блокировка.Заблокировать();

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		|	ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки
		|ИТОГИ
		|	СУММА(Количество),
		|	СУММА(Сумма)
		|ПО
		|	Номенклатура,
		|	Склад";

		Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени()));

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаНоменклатура.Следующий() Цикл

			ВыборкаНоменклатураСклад = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаНоменклатураСклад.Следующий() Цикл

				Движение = Движения.ТоварыНаСкладах.ДобавитьПриход();
				Движение.Период = Дата;
				ЗаполнитьЗначенияСвойств(Движение, ВыборкаНоменклатураСклад, , "СрокГодности");

				Выборка = ВыборкаНоменклатураСклад.Выбрать();
				Пока Выборка.Следующий() Цикл
					Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
					Движение.Период = Дата;
					ЗаполнитьЗначенияСвойств(Движение, Выборка);

				КонецЦикла;

			КонецЦикла;

		КонецЦикла;

	КонецЕсли;
КонецПроцедуры
#КонецОбласти
